import React from 'react';
import './AboutPage.css';

const AboutPage = () => {
    return (
        <div className='aboutPage'>
            <h1>Про нас</h1>
            <p>Привіт. Мене звати Олександр. Я починаючий Front End розробник, який створив цей чат-бот для вашої зручності.</p>
            <p>Моя мета полягає в тому, щоб забезпечити вам швидкий та ефективний спосіб отримання відповідей на ваші запитання.</p>
            <p>Чат-бот підтримує різні функції, такі як відповіді на загальні запитання, відкриття зовнішніх посилань та виконання різних дій.</p>
            <p>Я продовжую розширювати можливості бота, додавати нові функції та покращувати його продуктивність.</p>
            <p>Бот буде можливо імпорувати в Ваш додаток чи на вашу сторінку, для виконання різноманітних завдань</p>
            <p>Дякую, що скористалися чат-ботом і сподіваюсь, що він буде корисним для вас та стане гарним помічником для Вас.</p>

            <h2>Наші цінності</h2>
            <ul>
                <li>Інновація</li>
                <li>Якість</li>
                <li>Користувачоорієнтованість</li>
                <li>Співпраця</li>
            </ul>

            <h2>Досягнення</h2>
            <p>Бот вміє ефективно відповідати на запитання, забезпечуючи швидку та точну інформацію.</p>
            <p>Я пишаємося своїми досягненнями і продовжуємо працювати над поліпшенням нашого продукту.</p>

            <h2>Зв'язок зі мною</h2>
            <p>Якщо у вас виникли запитання або пропозиції, будь ласка, зв'яжіться зі мною за допомогою наступних контактних даних:</p>
            <ul>
                <li>Електронна пошта: <a href="mailto:aavwork@ukr.net">aavwork@ukr.net</a></li>
                <li>телеграм: <a href="https://t.me/username_oleksandr" target="_blank">https://t.me/username_oleksandr</a></li>
                <li>Адреса: м. Кропивницький, Україна</li>
            </ul>


            <h2>Приєднуйтесь до нас</h2>
            <p>Приєднуйтесь щоб отримувати останні оновлення та новини:</p>
            <ul>
                <li>LinkedIn: <a href="https://www.linkedin.com/in/oleksandr-anastasiiev-374925259/" target="_blank">linkedin.com/in/oleksandr-anastasiiev-374925259</a></li>
                <li>GitHub: <a href="https://github.com/user-oleksandr" target="_blank">github.com/user-oleksandr</a></li>
            </ul>
        </div>
    );
};

export default AboutPage;
