export const conditions = {
    "привіт": "привіт 😊",
    "як справи?": "все добре, дякую 👍",
    "що ти робиш?": "я відповідаю на твої запитання 🤖",
    "який твій улюбленний колір?": "Мої алгоритми не розрізняють кольори 😅",
    "хто тебе створив?": "Мене створив Олександр, початківець розробник JS.",
    "що ти вмієш?": "Я постійно навчаюсь і розвиваюсь. Все що я вмію, ти можеш побачити в меню",
    "google": "відкриваю Google... 🌐",
    "maps": "відкриваю Google мапу... 🗺️",
    "погода": "відкриваю Sinoptik.UA... ☀️🌦️❄️",
    "youtube": "відкриваю YouTube... 📺",
    "music": "відкриваю YouTube музику... 🎵",
    "mail": "відкриваю пошту... 📧",
    "telegram": "відкриваю Telegram... ✉️"
}



