import React from 'react';
import './HomePage.css';

function HomePage() {
    return (
        <div className='homePage'>
            <h1>Ласкаво просимо до нашого чат-бота!</h1>
            <p>Тут ви можете отримати відповіді на ваші питання та здійснити різноманітні дії.</p>
            <p>Просто оберіть відповідний запит і бот надасть вам необхідну інформацію або виконає певну дію.</p>
            <p>Щоб розпочати, натисніть кнопку "Розгорнути бота" нижче і почніть спілкування!</p>

            <h2>Функції бота:</h2>
            <ul>
                <li>Відповіді на загальні запитання</li>
                <li>Відкриття Google та YouTube</li>
                <li>Перегляд погоди</li>
                <li>Відкриття Google Maps</li>
                <li>Надсилання електронної пошти</li>
                <li>Та багато іншого!</li>
            </ul>

            <h2>Як користуватись:</h2>
            <ol>
                <li>Натисніть на поле "Оберіть запит"</li>
                <li>Виберіть один із доступних запитів зі списку</li>
                <li>Натисніть кнопку "Відправити"</li>
                <li>Зачекайте на відповідь бота у чаті</li>
                <li>Повторіть процес для інших запитів або очистіть чат за допомогою кнопки "Очистити чат"</li>
            </ol>

            <h2>Приклади запитів:</h2>
            <ul>
                <li>"Привіт"</li>
                <li>"Як справи?"</li>
                <li>"Покажи мапу"</li>
                <li>"Відкрий Google"</li>
                <li>"Який сьогодні день?"</li>
            </ul>

            <h2>Примітка:</h2>
            <p>Будь ласка, зверніть увагу, що деякі запити можуть відкривати зовнішні посилання або потребувати
                Інтернет-підключення для отримання актуальних даних. Будьте обережні при відправці особистої
                інформації.</p>

            <h2>Додаткова інформація:</h2>
            <p>На цій сторінці ви знайдете всю необхідну інформацію про можливості чат-бота. Ви можете почати
                спілкування з ботом, обираючи запит зі списку або вводячи свій власний запит. Бот надасть вам відповідь
                в чаті, де ви зможете спілкуватись з ним.</p>
            <p>Крім відповідей на загальні запитання, бот також здатний відкривати Google та YouTube, показувати погоду,
                відкривати Google Maps, надсилати електронну пошту та виконувати багато інших дій.</p>
            <p>Ви можете скористатись прикладами запитів, щоб отримати загальне уявлення про те, які запити можна
                використовувати з ботом. Проте, будьте обережні, відправляючи запити, які вимагають особистої інформації
                або можуть відкривати зовнішні посилання.</p>
            <p>Будь ласка, дотримуйтесь інструкцій по використанню бота та насолоджуйтеся його функціоналом!</p>
        </div>
    );
}

export default HomePage;
